In [1]:
import pandas as pd

# Pandas - библиотека для работы с данными

# Объект класса Series

In [3]:
s1 = pd.Series([10, 20, 30, 40]) # создание на базе списка

In [4]:
s1

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
# создание на базе словаря

In [6]:
d1 = {'a': 100, 5: 20, 0: 500}

In [7]:
s2 = pd.Series(d1)

In [8]:
s2

a    100
5     20
0    500
dtype: int64

In [9]:
# явные индексы

In [10]:
s1[0]

10

In [11]:
s2[0]

500

In [13]:
s2['a']

100

In [15]:
s2.loc['a'] # атрибут индексатор для явных индексов

100

In [16]:
# неявные индексы
# атрибут индексатор для неявных индексов
s2.iloc[0]

100

In [17]:
s2.shape

(3,)

In [19]:
s1.shape

(4,)

In [20]:
s2.size

3

In [21]:
s2.index

Index(['a', 5, 0], dtype='object')

In [22]:
s2.size

3

In [23]:
s2.values

array([100,  20, 500], dtype=int64)

In [24]:
# Данные по населению городов Якутии

In [25]:
pop_d = {
    'Yakutsk': 318768,
    'Neryungri': 57009,
    'Vilyuisk': 11095
}

In [26]:
pop_d

{'Yakutsk': 318768, 'Neryungri': 57009, 'Vilyuisk': 11095}

In [27]:
pop_s = pd.Series(pop_d)
pop_s

Yakutsk      318768
Neryungri     57009
Vilyuisk      11095
dtype: int64

In [28]:
#1. вывести население выбранного города
#2. срез от нерюнгри до вилюйска

In [29]:
pop_s.values

array([318768,  57009,  11095], dtype=int64)

In [30]:
pop_s['Neryungri']

57009

In [31]:
pop_s[1:]

Neryungri    57009
Vilyuisk     11095
dtype: int64

In [32]:
pop_s['Neryungri':'Vilyuisk']

Neryungri    57009
Vilyuisk     11095
dtype: int64

# DataFrame

In [33]:
# Объект класса DataFrame

In [34]:
d2 = {
    'col_1': {'row_1': 100, 'row_2': 200},
    'col_2': {'row_2': 300, 'row_3': 400}    
}

In [35]:
d2

{'col_1': {'row_1': 100, 'row_2': 200}, 'col_2': {'row_2': 300, 'row_3': 400}}

In [40]:
df1 = pd.DataFrame(d2)

In [41]:
df1

       col_1  col_2
row_1  100.0    NaN
row_2  200.0  300.0
row_3    NaN  400.0

In [43]:
data = pd.read_csv('C:/Users/Геннадий Варламов/OneDrive/Рабочий стол/Altan_2/data_analytics/data/president_heights.csv')

In [47]:
data.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [52]:
# данные из столбца
data['name']

0          George Washington
1                 John Adams
2           Thomas Jefferson
3              James Madison
4               James Monroe
5          John Quincy Adams
6             Andrew Jackson
7           Martin Van Buren
8     William Henry Harrison
9                 John Tyler
10             James K. Polk
11            Zachary Taylor
12          Millard Fillmore
13           Franklin Pierce
14            James Buchanan
15           Abraham Lincoln
16            Andrew Johnson
17          Ulysses S. Grant
18       Rutherford B. Hayes
19         James A. Garfield
20         Chester A. Arthur
21         Benjamin Harrison
22          William McKinley
23        Theodore Roosevelt
24       William Howard Taft
25            Woodrow Wilson
26         Warren G. Harding
27           Calvin Coolidge
28            Herbert Hoover
29     Franklin D. Roosevelt
30           Harry S. Truman
31      Dwight D. Eisenhower
32           John F. Kennedy
33         Lyndon B. Johnson
34             Richard Nixon
35               Gerald Ford
36              Jimmy Carter
37             Ronald Reagan
38         George H. W. Bush
39              Bill Clinton
40            George W. Bush
41              Barack Obama
Name: name, dtype: object

In [56]:
# данные из строки
data.loc[1, :]

order                  2
name          John Adams
height(cm)           170
Name: 1, dtype: object

In [57]:
data.loc[0, 'name']

'George Washington'

In [58]:
data.loc[0:20, 'name':]

                      name  height(cm)
0        George Washington         189
1               John Adams         170
2         Thomas Jefferson         189
3            James Madison         163
4             James Monroe         183
5        John Quincy Adams         171
6           Andrew Jackson         185
7         Martin Van Buren         168
8   William Henry Harrison         173
9               John Tyler         183
10           James K. Polk         173
11          Zachary Taylor         173
12        Millard Fillmore         175
13         Franklin Pierce         178
14          James Buchanan         183
15         Abraham Lincoln         193
16          Andrew Johnson         178
17        Ulysses S. Grant         173
18     Rutherford B. Hayes         174
19       James A. Garfield         183
20       Chester A. Arthur         183

In [84]:
data.tail()

    order               name  height(cm)
37     40      Ronald Reagan         185
38     41  George H. W. Bush         188
39     42       Bill Clinton         188
40     43     George W. Bush         182
41     44       Barack Obama         185

In [60]:
# минимальный рост и максимальный рост

In [70]:
data['height(cm)'].min(), data['height(cm)'].max()

(163, 193)

In [ ]:
data['height(cm)'].min(), data['height(cm)'].max()

In [75]:
mask1 = data['height(cm)'] < 170

In [76]:
data[mask1]

    order               name  height(cm)
3       4      James Madison         163
7       8   Martin Van Buren         168
21     23  Benjamin Harrison         168

In [73]:
mask2 = data['height(cm)'] > 170

In [83]:
data[mask2].tail()

    order               name  height(cm)
15     16    Abraham Lincoln         193
33     36  Lyndon B. Johnson         193

In [79]:
data.loc[mask1, :]

    order               name  height(cm)
3       4      James Madison         163
7       8   Martin Van Buren         168
21     23  Benjamin Harrison         168

In [80]:
mask2 = data['height(cm)'] > 190

In [81]:
data.loc[mask2, :]

    order               name  height(cm)
15     16    Abraham Lincoln         193
33     36  Lyndon B. Johnson         193

In [88]:
data.loc[data['name'] == 'Barack Obama', :]

    order          name  height(cm)
41     44  Barack Obama         185

In [89]:
data.loc[data['name'] == 'Barack Obama', 'height(cm)']

41    185
Name: height(cm), dtype: int64